# ДЗ до среды (ну вообще до следующего воскресенья):

# 1. Реализовать алгоритм RLE (упрощенный - это на случай вдруг вы полезете в Wiki)
# что такое RLE? алгоритм сжатия данных, например
# ssssdddfffffgggggggghhkkk -> 4s3d5f8g2h3k
# запаковка и распаковка в обратную сторону
# делаем файл с рандомно созданными строками (как запакованными, так и распакованными)
# считываем файл функция определяет - запакована строка или распакована
# и выполнить соответствующий алгоритм - результаты записать в новый файл
