
# Дополнительные сложные задачи (по желанию):

# Декларативное программирование:

# Задача 8: Вычисление суммы цифр числа. Напишите программу, которая вычисляет сумму всех цифр заданного числа, используя математические операции и деление нацело.


import functools

num=input('введите число ')
print(sum([int(digit) for digit in num]))
