# Упражнение 9. Сложные проценты
# (19 строк)
# Представьте, что вы открыли в банке сберегательный счет под 4 % годо-
# вых. Проценты банк рассчитывает в конце года и добавляет к сумме счета.
# Напишите программу, которая запрашивает у пользователя сумму перво-
# начального депозита, после чего рассчитывает и выводит на экран сумму
# на счету в конце первого, второго и третьего годов. Все суммы должны
# быть округлены до двух знаков после запятой.


summa=int(input('Введите сумму на счете - > '))
print(f'сумма после первого года {summa+summa*0.04}')
print(f'сумма после второго года {(summa+summa*0.04)+(summa+summa*0.04)*0.04}')
print(f'сумма после третьего года {((summa+summa*0.04)+(summa+summa*0.04)*0.04) + ((summa+summa*0.04)+(summa+summa*0.04)*0.04)*0.04}')
