# Упражнение 12. Расстояние между точками на Земле
# (27 строк)
# Как известно, поверхность планеты Земля искривлена, и расстояние меж-
# ду точками, характеризующимися одинаковыми градусами по долготе,
# может быть разным в зависимости от широты. Таким образом, для вычис-
# ления расстояния между двумя точками на Земле одной лишь теоремой
# Пифагора не обойтись.
# Допустим, (t1, g1) и (t2, g2) – координаты широты и долготы двух точек на
# поверхности Земли. Тогда расстояние в километрах между ними с учетом
# искривленности планеты можно найти по следующей формуле:
# distance = 6371,01´arccos(sin(t1)´sin(t2) + cos(t1)´cos(t2)´cos(g1 - g2)).

# Примечание. Число 6371,01 в этой формуле, конечно, было выбрано не случайно
# и представляет собой среднее значение радиуса Земли в километрах.
# Напишите программу, в которой пользователь будет вводить коорди-
# наты двух точек на Земле (широту и долготу) в градусах. На выходе мы
# должны получить расстояние между этими точками при следовании по
# кратчайшему пути по поверхности планеты.

# Подсказка. Тригонометрические функции в Python оперируют радианами. Таким
# образом, вам придется введенные пользователем величины из градусов перевести
# в радианы, прежде чем вычислять расстояние между точками. В модуле math есть
# удобная функция с названием radians-Функции:radians, служащая как раз для пере-
# вода градусов в радианы.

import math

t1=math.radians(float(input('Введите первую координату первой точки -> ')))
g1=math.radians(float(input('Введите вторую координату первой точки -> ')))

t2=math.radians(float(input('Введите первую координату второй точки -> ')))
g2=math.radians(float(input('Введите вторую координату второй точки -> ')))

distance = 6371.01*math.acosh(math.sin(t1)*math.sin(t2) + math.cos(t1)*math.cos(t2)*math.cos(g1 - g2))

print('расстояние между точками = ', format(distance, ':.3f'))